/*
Navicat MySQL Data Transfer

Source Server         : 10.65.8.95
Source Server Version : 50540
Source Host           : 10.65.8.95:3306
Source Database       : portal

Target Server Type    : MYSQL
Target Server Version : 50540
File Encoding         : 65001

Date: 2016-03-29 15:32:32
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for office_credit_score_rule
-- ----------------------------
DROP TABLE IF EXISTS `office_credit_score_rule`;
CREATE TABLE `office_credit_score_rule` (
  `level1_id` bigint(20) DEFAULT NULL COMMENT '一级目录编码（用户类型）',
  `level1_name` varchar(255) DEFAULT NULL COMMENT '一级目录名称',
  `level2_id` bigint(20) DEFAULT NULL COMMENT '二级目录编码',
  `level2_name` varchar(255) DEFAULT NULL COMMENT '二级目录名称',
  `level3_id` bigint(20) DEFAULT NULL COMMENT '三级目录编码',
  `level3_name` varchar(255) DEFAULT NULL COMMENT '三级目录名称',
  `level4_id` bigint(20) DEFAULT NULL COMMENT '四级目录编码',
  `level4_name` varchar(255) DEFAULT NULL COMMENT '四级目录名称',
  `level4_score` bigint(20) DEFAULT NULL COMMENT '四级目录分值',
  `level5_id` bigint(20) DEFAULT NULL COMMENT '五级目录编码',
  `level5_name` varchar(255) DEFAULT NULL COMMENT '五级目录名称',
  `value` double DEFAULT NULL COMMENT '五级目录分值',
  `flag` int(11) DEFAULT NULL COMMENT '加分减分标识（1为加分0为不加不减-1为减分）',
  `type` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of office_credit_score_rule
-- ----------------------------
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010101', '*年度工作目标完成情况（优秀/良好/合格/不合格）', '15', '10201010101', '优秀', '15', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010101', '*年度工作目标完成情况（优秀/良好/合格/不合格）', '15', '10201010102', '良好', '5', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010101', '*年度工作目标完成情况（优秀/良好/合格/不合格）', '15', '10201010103', '合格', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010101', '*年度工作目标完成情况（优秀/良好/合格/不合格）', '15', '10201010104', '不合格', '15', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010102', '年度绩效考核得分（优秀/良好/合格/不合格）', '20', '10201010201', '优秀', '10', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010102', '年度绩效考核得分（优秀/良好/合格/不合格）', '20', '10201010202', '良好', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010102', '年度绩效考核得分（优秀/良好/合格/不合格）', '20', '10201010203', '合格', '10', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010102', '年度绩效考核得分（优秀/良好/合格/不合格）', '20', '10201010204', '不合格', '40', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010103', '工作实绩弄虚作假情况（无/情节较轻/情节较重/情节严重）', '30', '10201010301', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010103', '工作实绩弄虚作假情况（无/情节较轻/情节较重/情节严重）', '30', '10201010302', '情节较轻', '15', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010103', '工作实绩弄虚作假情况（无/情节较轻/情节较重/情节严重）', '30', '10201010303', '情节较重', '30', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020101', '任务完成情况', '102010103', '工作实绩弄虚作假情况（无/情节较轻/情节较重/情节严重）', '30', '10201010304', '情节严重', '50', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020102', '“三单”执行情况', '102010201', '政务信息公开情况（完全公开/部分公开/未公开）', '48', '10201020101', '完全公开', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020102', '“三单”执行情况', '102010201', '政务信息公开情况（完全公开/部分公开/未公开）', '48', '10201020102', '部分公开', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020102', '“三单”执行情况', '102010201', '政务信息公开情况（完全公开/部分公开/未公开）', '48', '10201020103', '未公开', '48', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020102', '“三单”执行情况', '102010202', '三单考核得分', '0', '10201020201', '0', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020102', '“三单”执行情况', '102010202', '三单考核得分', '0', '10201020202', '1', '0.45', '1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010301', '*向社会公开承诺事项落实情况（全部落实/部分落实/未落实/情节严重）', '27', '10201030101', '全部落实', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010301', '*向社会公开承诺事项落实情况（全部落实/部分落实/未落实/情节严重）', '27', '10201030102', '部分落实', '17', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010301', '*向社会公开承诺事项落实情况（全部落实/部分落实/未落实/情节严重）', '27', '10201030103', '未落实', '27', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010301', '*向社会公开承诺事项落实情况（全部落实/部分落实/未落实/情节严重）', '27', '10201030104', '情节严重', '47', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010302', '*党风廉政建设责任制落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030201', '全部落实', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010302', '*党风廉政建设责任制落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030202', '部分落实', '12', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010302', '*党风廉政建设责任制落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030203', '未落实', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010302', '*党风廉政建设责任制落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030204', '情节严重', '44', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010303', '*社会治安综合治理落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030301', '全部落实', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010303', '*社会治安综合治理落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030302', '部分落实', '12', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010303', '*社会治安综合治理落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030303', '未落实', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010303', '*社会治安综合治理落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030304', '情节严重', '44', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010304', '*计划生育政策落实情况（全部落实/部分落实/未落实/情节严重）', '12', '10201030401', '全部落实', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010304', '*计划生育政策落实情况（全部落实/部分落实/未落实/情节严重）', '12', '10201030402', '部分落实', '6', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010304', '*计划生育政策落实情况（全部落实/部分落实/未落实/情节严重）', '12', '10201030403', '未落实', '12', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010304', '*计划生育政策落实情况（全部落实/部分落实/未落实/情节严重）', '12', '10201030404', '情节严重', '32', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010305', '*安全生产责任落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030501', '全部落实', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010305', '*安全生产责任落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030502', '部分落实', '12', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010305', '*安全生产责任落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030503', '未落实', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010305', '*安全生产责任落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030504', '情节严重', '44', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010306', '*上级部门和领导督办事项落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030601', '全部落实', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010306', '*上级部门和领导督办事项落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030602', '部分落实', '12', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010306', '*上级部门和领导督办事项落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030603', '未落实', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010306', '*上级部门和领导督办事项落实情况（全部落实/部分落实/未落实/情节严重）', '24', '10201030604', '情节严重', '44', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010307', '全市举办的会议、活动缺席次数', '12', '10201030701', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010307', '全市举办的会议、活动缺席次数', '12', '10201030702', '1', '6', '-1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010308', '*社会评估、投诉情况（优秀/良好/一般/差/情节严重）', '24', '10201030801', '优秀', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010308', '*社会评估、投诉情况（优秀/良好/一般/差/情节严重）', '24', '10201030802', '良好', '4', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010308', '*社会评估、投诉情况（优秀/良好/一般/差/情节严重）', '24', '10201030803', '一般', '9', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010308', '*社会评估、投诉情况（优秀/良好/一般/差/情节严重）', '24', '10201030804', '差', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10201', '履职信息', '1020103', '责任落实情况', '102010308', '*社会评估、投诉情况（优秀/良好/一般/差/情节严重）', '24', '10201030805', '情节严重', '44', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020101', '*履行商业合同情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010101', '无违规', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020101', '*履行商业合同情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010102', '违规程度轻', '4', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020101', '*履行商业合同情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010103', '违规程度较轻', '9', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020101', '*履行商业合同情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010104', '违规程度中', '14', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020101', '*履行商业合同情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010105', '违规程度较重', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020101', '*履行商业合同情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010106', '违规程度严重', '44', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020102', '*拖欠债务情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010201', '无违规', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020102', '*拖欠债务情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010202', '违规程度轻', '4', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020102', '*拖欠债务情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010203', '违规程度较轻', '9', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020102', '*拖欠债务情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010204', '违规程度中', '14', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020102', '*拖欠债务情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010206', '违规程度较重', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020102', '*拖欠债务情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010205', '违规程度严重', '44', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020103', '偷、逃、欠、骗、抗税、接收违规发票罚款金额', '24', '10202010301', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020103', '偷、逃、欠、骗、抗税、接收违规发票罚款金额', '24', '10202010302', '1000', '4', '-1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020104', '长期拖欠水、电费，偷盗、违规用水、用电金额', '21', '10202010401', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020104', '长期拖欠水、电费，偷盗、违规用水、用电金额', '21', '10202010402', '500', '3', '-1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020105', '*乱收费情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010501', '无违规', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020105', '*乱收费情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010502', '违规程度轻', '4', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020105', '*乱收费情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010503', '违规程度较轻', '9', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020105', '*乱收费情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010504', '违规程度中', '14', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020105', '*乱收费情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010506', '违规程度较重', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10202', '商业活动信息', '1020201', '商业活动信息', '102020105', '*乱收费情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '24', '10202010505', '违规程度严重', '44', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030101', '不作为、乱作为、违纪违规情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '12', '10203010101', '无违规', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030101', '不作为、乱作为、违纪违规情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '12', '10203010102', '违规程度轻', '6', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030101', '不作为、乱作为、违纪违规情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '12', '10203010103', '违规程度较轻', '10', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030101', '不作为、乱作为、违纪违规情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '12', '10203010104', '违规程度中', '12', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030101', '不作为、乱作为、违纪违规情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '12', '10203010105', '违规程度较重', '22', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030101', '不作为、乱作为、违纪违规情况（无违规/违规程度轻/违规程度较轻/违规程度中/违规程度较重/违规程度严重）', '12', '10203010106', '违规程度严重', '32', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030102', '受通报批评等处理次数', '12', '10203010201', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030102', '受通报批评等处理次数', '12', '10203010202', '1次', '12', '-1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030103', '**单位员工违纪违规人数', '15', '10203010301', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020301', '违纪违规情况', '102030103', '**单位员工违纪违规人数', '15', '10203010302', '1', '6', '-1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030201', '单位行政处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020101', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030201', '单位行政处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020102', '情节较轻', '18', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030201', '单位行政处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020103', '情节一般', '36', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030201', '单位行政处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020104', '情节较重', '48', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030201', '单位行政处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020105', '违规程度严重', '78', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030202', '单位人员刑事处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020201', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030202', '单位人员刑事处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020202', '情节较轻', '18', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030202', '单位人员刑事处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020203', '情节一般', '36', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030202', '单位人员刑事处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020204', '情节较重', '48', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030202', '单位人员刑事处罚情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020205', '违规程度严重', '78', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030203', '履行司法文书情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020301', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030203', '履行司法文书情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020302', '情节较轻', '18', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030203', '履行司法文书情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020303', '情节一般', '36', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030203', '履行司法文书情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020304', '情节较重', '48', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030203', '履行司法文书情况（无/情节较轻/情节一般/情节较重/违规程度严重/）', '18', '10203020305', '违规程度严重', '78', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030204', '拖欠社保金情况（无/情节较轻/情节一般/情节较重/违规程度严重）', '12', '10203020401', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030204', '拖欠社保金情况（无/情节较轻/情节一般/情节较重/违规程度严重）', '12', '10203020402', '情节较轻', '12', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030204', '拖欠社保金情况（无/情节较轻/情节一般/情节较重/违规程度严重）', '12', '10203020403', '情节一般', '24', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030204', '拖欠社保金情况（无/情节较轻/情节一般/情节较重/违规程度严重）', '12', '10203020404', '情节较重', '36', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030204', '拖欠社保金情况（无/情节较轻/情节一般/情节较重/违规程度严重）', '12', '10203020405', '违规程度严重', '78', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030205', '单位员工违法人数', '12', '10203020501', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020302', '违法情况', '102030205', '单位员工违法人数', '12', '10203020502', '1', '12', '-1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030301', '国家级荣誉次数（加分项）', '0', '10203030101', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030301', '国家级荣誉次数（加分项）', '0', '10203030102', '1', '40', '1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030302', '省级荣誉次数（加分项）', '0', '10203030201', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030302', '省级荣誉次数（加分项）', '0', '10203030202', '1', '30', '1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030303', '市级荣誉次数（加分项）', '0', '10203030301', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030303', '市级荣誉次数（加分项）', '0', '10203030302', '1', '20', '1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030304', '获市（含）级以上通报表扬次数（加分项）', '0', '10203030401', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030304', '获市（含）级以上通报表扬次数（加分项）', '0', '10203030402', '1', '10', '1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030305', '县级荣誉次数（加分项）', '0', '10203030501', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030305', '县级荣誉次数（加分项）', '0', '10203030502', '1', '10', '1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030306', '群众赞扬事件次数（加分项）', '0', '10203030602', '1', '6', '1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030306', '群众赞扬事件次数（加分项）', '0', '10203030601', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030307', '单位员工获奖人次', '0', '10203030701', '无', '0', '0', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10203', '奖惩信息', '1020303', '荣誉情况', '102030307', '单位员工获奖人次', '0', '10203030702', '1', '6', '1', '1');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040101', '**参与文明创建情况（优秀/合格/不合格/有通报批评）', '9', '10204010101', '优秀', '9', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040101', '**参与文明创建情况（优秀/合格/不合格/有通报批评）', '9', '10204010102', '合格', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040101', '**参与文明创建情况（优秀/合格/不合格/有通报批评）', '9', '10204010103', '不合格', '9', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040101', '**参与文明创建情况（优秀/合格/不合格/有通报批评）', '9', '10204010104', '有通报批评', '14', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040102', '开展志愿服务情况（优秀/合格/不合格/有通报批评）', '9', '10204010201', '优秀', '9', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040102', '开展志愿服务情况（优秀/合格/不合格/有通报批评）', '9', '10204010202', '合格', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040102', '开展志愿服务情况（优秀/合格/不合格/有通报批评）', '9', '10204010203', '不合格', '9', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040102', '开展志愿服务情况（优秀/合格/不合格/有通报批评）', '9', '10204010204', '有通报批评', '14', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040103', '**开展扶贫救困及帮扶情况（加分项）（优秀/达标/不达标/有通报批评）', '0', '10204010301', '优秀', '18', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040103', '**开展扶贫救困及帮扶情况（加分项）（优秀/达标/不达标/有通报批评）', '0', '10204010302', '合格', '9', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040103', '**开展扶贫救困及帮扶情况（加分项）（优秀/达标/不达标/有通报批评）', '0', '10204010303', '不合格', '0', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040103', '**开展扶贫救困及帮扶情况（加分项）（优秀/达标/不达标/有通报批评）', '0', '10204010304', '有通报批评', '5', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040103', '**开展扶贫救困及帮扶情况（加分项）（优秀/达标/不达标/有通报批评）', '0', '10204010305', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040104', '**开展招商引资情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010401', '优秀', '9', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040104', '**开展招商引资情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010402', '合格', '6', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040104', '**开展招商引资情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010403', '不合格', '0', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040104', '**开展招商引资情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010404', '有通报批评', '5', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040104', '**开展招商引资情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010405', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040105', '**开展新农村驻村包点帮扶情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010501', '优秀', '18', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040105', '**开展新农村驻村包点帮扶情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010502', '合格', '9', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040105', '**开展新农村驻村包点帮扶情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010503', '不合格', '0', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040105', '**开展新农村驻村包点帮扶情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010504', '有通报批评', '5', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040105', '**开展新农村驻村包点帮扶情况（加分项）（优秀/合格/不合格/有通报批评）', '0', '10204010505', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040106', '**开展企业帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010601', '优秀', '18', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040106', '**开展企业帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010602', '合格', '9', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040106', '**开展企业帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010603', '不合格', '0', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040106', '**开展企业帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010604', '有通报批评', '5', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040106', '**开展企业帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010605', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040107', '开展网格化帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010701', '优秀', '18', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040107', '开展网格化帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010702', '合格', '9', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040107', '开展网格化帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010703', '不合格', '0', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040107', '开展网格化帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010705', '有通报批评', '5', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040107', '开展网格化帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010704', '无', '0', '0', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040108', '**重点项目帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010801', '优秀', '18', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040108', '**重点项目帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010802', '合格', '9', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040108', '**重点项目帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010803', '不合格', '0', '1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040108', '**重点项目帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010805', '有通报批评', '5', '-1', '0');
INSERT INTO `office_credit_score_rule` VALUES ('102', '机关事业单位', '10204', '重点活动信息', '1020401', '重点活动信息', '102040108', '**重点项目帮扶情况（优秀/合格/不合格/有通报批评）', '0', '10204010804', '无', '0', '0', '0');
