/*
Navicat MySQL Data Transfer

Source Server         : 10.65.8.95
Source Server Version : 50540
Source Host           : 10.65.8.95:3306
Source Database       : portal

Target Server Type    : MYSQL
Target Server Version : 50540
File Encoding         : 65001

Date: 2016-03-29 15:32:19
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for person_credit_score_rule
-- ----------------------------
DROP TABLE IF EXISTS `person_credit_score_rule`;
CREATE TABLE `person_credit_score_rule` (
  `level1_id` bigint(20) DEFAULT NULL COMMENT '一级目录编码（用户类型）',
  `level1_name` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '一级目录名称',
  `level2_id` bigint(20) DEFAULT NULL COMMENT '二级目录编码',
  `level2_name` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '二级目录名称',
  `level3_id` bigint(20) DEFAULT NULL COMMENT '三级目录编码',
  `level3_name` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '三级目录名称',
  `level4_id` bigint(20) DEFAULT NULL COMMENT '四级目录编码',
  `level4_name` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '四级目录名称',
  `level4_score` bigint(20) DEFAULT NULL COMMENT '四级目录分值',
  `level5_id` bigint(20) DEFAULT NULL COMMENT '五级目录编码',
  `level5_name` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '五级目录名称',
  `value` double DEFAULT NULL COMMENT '五级目录得分',
  `flag` int(11) DEFAULT NULL COMMENT '加分减分标识（1为加分0为不加不减-1为减分）',
  `type` int(11) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of person_credit_score_rule
-- ----------------------------
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010101', '个人档案填报情况', '101010101', '出生年月涂改（是/否）', '6', '10101010101', '是', '6', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010101', '个人档案填报情况', '101010101', '出生年月涂改（是/否）', '6', '10101010102', '否', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010101', '个人档案填报情况', '101010102', '学历不属实（是/否）', '6', '10101010201', '否', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010101', '个人档案填报情况', '101010102', '学历不属实（是/否）', '6', '10101010202', '是', '6', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010101', '个人档案填报情况', '101010103', '专业技术职称不属实（是/否）', '9', '10101010301', '否', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010101', '个人档案填报情况', '101010103', '专业技术职称不属实（是/否）', '9', '10101010302', '是', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010101', '个人档案填报情况', '101010104', '证件造假（是/否）', '9', '10101010401', '是', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010101', '个人档案填报情况', '101010104', '证件造假（是/否）', '9', '10101010402', '否', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010201', '个人事项申报不属实（归档/补充报告并说明/补充报告并诫勉/补充报告批评教育/停止选拔任用/暂缓任用）', '24', '10101020101', '归档', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010201', '个人事项申报不属实（归档/补充报告并说明/补充报告并诫勉/补充报告批评教育/停止选拔任用/暂缓任用）', '24', '10101020102', '补充报告并说明', '6', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010201', '个人事项申报不属实（归档/补充报告并说明/补充报告并诫勉/补充报告批评教育/停止选拔任用/暂缓任用）', '24', '10101020104', '补充报告并诫勉', '24', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010201', '个人事项申报不属实（归档/补充报告并说明/补充报告并诫勉/补充报告批评教育/停止选拔任用/暂缓任用）', '24', '10101020103', '补充报告批评教育', '14', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010201', '个人事项申报不属实（归档/补充报告并说明/补充报告并诫勉/补充报告批评教育/停止选拔任用/暂缓任用）', '24', '10101020106', '停止选拔任用', '124', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010201', '个人事项申报不属实（归档/补充报告并说明/补充报告并诫勉/补充报告批评教育/停止选拔任用/暂缓任用）', '24', '10101020105', '暂缓任用', '104', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010202', '个人重大事项不及时报告（无/轻微/较重/严重）', '24', '10101020201', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010202', '个人重大事项不及时报告（无/轻微/较重/严重）', '24', '10101020202', '轻微', '8', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010202', '个人重大事项不及时报告（无/轻微/较重/严重）', '24', '10101020203', '较重', '16', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010102', '个人事项申报情况', '101010202', '个人重大事项不及时报告（无/轻微/较重/严重）', '24', '10101020204', '严重', '24', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010301', '信用卡逾期次数', '15', '10101030101', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010301', '信用卡逾期次数', '15', '10101030102', '1', '5', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010302', '不良贷款总金额', '15', '10101030201', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010302', '不良贷款总金额', '15', '10101030202', '1000', '3', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010303', '恶意欠款（有/无）', '15', '10101030301', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010303', '恶意欠款（有/无）', '15', '10101030302', '有', '143', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010304', '偷、逃、欠、骗、抗税、虚开发票及接收违规发票（有/无）', '12', '10101030401', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010304', '偷、逃、欠、骗、抗税、虚开发票及接收违规发票（有/无）', '12', '10101030402', '有', '93', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010305', '因私景区旅游不买门票次数', '12', '10101030501', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010305', '因私景区旅游不买门票次数', '12', '10101030502', '1', '4', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010306', '乘汽车、火车不买票次数', '12', '10101030601', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010306', '乘汽车、火车不买票次数', '12', '10101030602', '1', '4', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010307', '恶意拖欠水、电、气等费用以及偷盗、违规用水、电等金额', '12', '10101030701', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010103', '商业信用情况', '101010307', '恶意拖欠水、电、气等费用以及偷盗、违规用水、电等金额', '12', '10101030702', '100', '5', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010104', '交通违章情况', '101010401', '交通违规违法罚款金额', '16', '10101040101', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010104', '交通违章情况', '101010401', '交通违规违法罚款金额', '16', '10101040102', '100', '4', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010104', '交通违章情况', '101010402', '驾照扣分分值', '16', '10101040201', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010104', '交通违章情况', '101010402', '驾照扣分分值', '16', '10101040202', '1', '2', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010104', '交通违章情况', '101010403', '乱停乱放次数', '14', '10101040301', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010104', '交通违章情况', '101010403', '乱停乱放次数', '14', '10101040302', '1', '3', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010501', '私搭乱建情况', '9', '10101050101', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010501', '私搭乱建情况', '9', '10101050102', '有', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010502', '恶意拖欠物业费总金额', '9', '10101050201', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010502', '恶意拖欠物业费总金额', '9', '10101050202', '欠费金额200元以下', '5', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010502', '恶意拖欠物业费总金额', '9', '10101050203', '欠费金额200-1000元', '15', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010502', '恶意拖欠物业费总金额', '9', '10101050204', '欠费金额1000-3000元', '20', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010502', '恶意拖欠物业费总金额', '9', '10101050205', '欠费金额3000元以上', '35', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010503', '*邻里不和谐情况（如扰民噪音、打架相骂、乱倒垃圾等影响极坏行为）（无/轻微/较重/严重）', '9', '10101050301', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010503', '*邻里不和谐情况（如扰民噪音、打架相骂、乱倒垃圾等影响极坏行为）（无/轻微/较重/严重）', '9', '10101050302', '轻微', '5', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010503', '*邻里不和谐情况（如扰民噪音、打架相骂、乱倒垃圾等影响极坏行为）（无/轻微/较重/严重）', '9', '10101050303', '较重', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010503', '*邻里不和谐情况（如扰民噪音、打架相骂、乱倒垃圾等影响极坏行为）（无/轻微/较重/严重）', '9', '10101050304', '严重', '13', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010504', '社区内乱停乱放次数', '9', '10101050401', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10101', '基本信用信息', '1010105', '社区生活情况', '101010504', '社区内乱停乱放次数', '9', '10101050402', '1', '3', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020101', '*是否按职责行事（优秀/称职/基本称职/不称职）', '18', '10102010101', '优秀', '6', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020101', '*是否按职责行事（优秀/称职/基本称职/不称职）', '18', '10102010102', '称职', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020101', '*是否按职责行事（优秀/称职/基本称职/不称职）', '18', '10102010103', '基本称职', '6', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020101', '*是否按职责行事（优秀/称职/基本称职/不称职）', '18', '10102010104', '不称职', '18', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020102', '*是否完成工作任务（好/较好/一般/较差/差）', '14', '10102010201', '好', '10', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020102', '*是否完成工作任务（好/较好/一般/较差/差）', '14', '10102010202', '较好', '6', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020102', '*是否完成工作任务（好/较好/一般/较差/差）', '14', '10102010203', '一般', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020102', '*是否完成工作任务（好/较好/一般/较差/差）', '14', '10102010204', '较差', '6', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020102', '*是否完成工作任务（好/较好/一般/较差/差）', '14', '10102010205', '差', '14', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020103', '*是否有乱作为情况（无/情节较轻/情节严重）', '18', '10102010301', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020103', '*是否有乱作为情况（无/情节较轻/情节严重）', '18', '10102010302', '情节较轻', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010201', '承诺情况', '101020103', '*是否有乱作为情况（无/情节较轻/情节严重）', '18', '10102010303', '情节严重', '18', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020201', '上班迟到、早退、旷工记录；缺席会议、代会情况（无/较轻/一般/较重/严重）', '9', '10102020101', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020201', '上班迟到、早退、旷工记录；缺席会议、代会情况（无/较轻/一般/较重/严重）', '9', '10102020102', '较轻', '3', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020201', '上班迟到、早退、旷工记录；缺席会议、代会情况（无/较轻/一般/较重/严重）', '9', '10102020103', '一般', '6', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020201', '上班迟到、早退、旷工记录；缺席会议、代会情况（无/较轻/一般/较重/严重）', '9', '10102020104', '较重', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020201', '上班迟到、早退、旷工记录；缺席会议、代会情况（无/较轻/一般/较重/严重）', '9', '10102020105', '严重', '18', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020202', '通报批评次数', '12', '10102020201', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020202', '通报批评次数', '12', '10102020202', '1', '12', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020203', '重大失误次数', '18', '10102020301', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020203', '重大失误次数', '18', '10102020302', '1', '18', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020204', '处分等级（无/警告/记过/记大过/降级/撤职/开除）', '18', '10102020401', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020204', '处分等级（无/警告/记过/记大过/降级/撤职/开除）', '18', '10102020402', '警告', '18', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020204', '处分等级（无/警告/记过/记大过/降级/撤职/开除）', '18', '10102020403', '记过', '36', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020204', '处分等级（无/警告/记过/记大过/降级/撤职/开除）', '18', '10102020404', '记大过', '48', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020204', '处分等级（无/警告/记过/记大过/降级/撤职/开除）', '18', '10102020405', '降级', '118', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020204', '处分等级（无/警告/记过/记大过/降级/撤职/开除）', '18', '10102020406', '撤职', '218', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020204', '处分等级（无/警告/记过/记大过/降级/撤职/开除）', '18', '10102020407', '开除', '418', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020205', '参与非正常上访次数', '18', '10102020501', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020205', '参与非正常上访次数', '18', '10102020502', '1', '18', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020206', '索拿卡要等违反职业道德行为情况（无/较轻/较重/严重）', '15', '10102020601', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020206', '索拿卡要等违反职业道德行为情况（无/较轻/较重/严重）', '15', '10102020602', '情节较轻', '15', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020206', '索拿卡要等违反职业道德行为情况（无/较轻/较重/严重）', '15', '10102020603', '情节较重', '30', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010202', '违纪违规情况', '101020206', '索拿卡要等违反职业道德行为情况（无/较轻/较重/严重）', '15', '10102020604', '情节严重', '60', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020301', '罚没款总金额', '15', '10102030101', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020301', '罚没款总金额', '15', '10102030102', '100', '3', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020302', '（失信）被执行情况（好/较好/一般/较差/差/极差）', '15', '10102030201', '好', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020302', '（失信）被执行情况（好/较好/一般/较差/差/极差）', '15', '10102030202', '较好', '3', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020302', '（失信）被执行情况（好/较好/一般/较差/差/极差）', '15', '10102030203', '一般', '6', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020302', '（失信）被执行情况（好/较好/一般/较差/差/极差）', '15', '10102030204', '较差', '20', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020302', '（失信）被执行情况（好/较好/一般/较差/差/极差）', '15', '10102030205', '差', '45', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020302', '（失信）被执行情况（好/较好/一般/较差/差/极差）', '15', '10102030206', '极差', '65', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020303', '行政拘留次数', '15', '10102030301', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010203', '违法情况', '101020303', '行政拘留次数', '15', '10102030302', '1', '15', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010204', '政治品德情况', '101020401', '*参加非法组织及活动（是/否）', '15', '10102040101', '否', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010204', '政治品德情况', '101020401', '*参加非法组织及活动（是/否）', '15', '10102040102', '是', '45', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010204', '政治品德情况', '101020402', '*访问违法网站总次数', '15', '10102040201', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010204', '政治品德情况', '101020402', '*访问违法网站总次数', '15', '10102040202', '1', '5', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010204', '政治品德情况', '101020403', '*发布反动言论、恶意煽动违法或反动活动总次数', '15', '10102040301', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010204', '政治品德情况', '101020403', '*发布反动言论、恶意煽动违法或反动活动总次数', '15', '10102040302', '1', '45', '-1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020501', '获国家级及以上荣誉次数（加分项）', '0', '10102050101', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020501', '获国家级及以上荣誉次数（加分项）', '0', '10102050102', '1', '40', '1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020502', '获省级荣誉次数（加分项）', '0', '10102050201', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020502', '获省级荣誉次数（加分项）', '0', '10102050202', '1', '30', '1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020503', '获市级荣誉次数（加分项）', '0', '10102050301', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020503', '获市级荣誉次数（加分项）', '0', '10102050302', '1', '20', '1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020504', '获县级荣誉次数（加分项）', '0', '10102050401', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020504', '获县级荣誉次数（加分项）', '0', '10102050402', '1', '10', '1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020505', '县级以下荣誉次数（加分项）', '0', '10102050501', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10102', '履职信用信息', '1010205', '获奖情况', '101020505', '县级以下荣誉次数（加分项）', '0', '10102050502', '1', '5', '1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030101', '*景区旅游不文明情况（无/较轻/较重/严重）', '8', '10103010101', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030101', '*景区旅游不文明情况（无/较轻/较重/严重）', '8', '10103010102', '较轻', '4', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030101', '*景区旅游不文明情况（无/较轻/较重/严重）', '8', '10103010103', '较重', '8', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030101', '*景区旅游不文明情况（无/较轻/较重/严重）', '8', '10103010104', '严重', '12', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030102', '*不讲公共秩序情况（无/较轻/较重/严重）', '8', '10103010201', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030102', '*不讲公共秩序情况（无/较轻/较重/严重）', '8', '10103010202', '较轻', '4', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030102', '*不讲公共秩序情况（无/较轻/较重/严重）', '8', '10103010203', '较重', '8', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030102', '*不讲公共秩序情况（无/较轻/较重/严重）', '8', '10103010204', '严重', '12', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030103', '*破坏环境情况（无/较轻/较重/严重）', '8', '10103010301', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030103', '*破坏环境情况（无/较轻/较重/严重）', '8', '10103010302', '较轻', '4', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030103', '*破坏环境情况（无/较轻/较重/严重）', '8', '10103010303', '较重', '8', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030103', '*破坏环境情况（无/较轻/较重/严重）', '8', '10103010304', '严重', '12', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030104', '*损坏公物情况（无/较轻/较重/严重）', '8', '10103010401', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030104', '*损坏公物情况（无/较轻/较重/严重）', '8', '10103010402', '较轻', '4', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030104', '*损坏公物情况（无/较轻/较重/严重）', '8', '10103010403', '较重', '8', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030104', '*损坏公物情况（无/较轻/较重/严重）', '8', '10103010404', '严重', '12', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030105', '见义勇为次数（加分项）', '0', '10103010501', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030105', '见义勇为次数（加分项）', '0', '10103010502', '1', '50', '1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030106', '参加志愿活动时长（加分项）', '0', '10103010601', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030106', '参加志愿活动时长（加分项）', '0', '10103010602', '10', '1', '1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030107', '获得志愿服务荣誉（加分项）（国家级/省级/县级/其他）', '0', '10103010701', '国家级', '30', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030107', '获得志愿服务荣誉（加分项）（国家级/省级/县级/其他）', '0', '10103010702', '省级', '20', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030107', '获得志愿服务荣誉（加分项）（国家级/省级/县级/其他）', '0', '10103010703', '市级', '10', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030107', '获得志愿服务荣誉（加分项）（国家级/省级/县级/其他）', '0', '10103010704', '其他', '2', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030107', '获得志愿服务荣誉（加分项）（国家级/省级/县级/其他）', '0', '10103010705', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030108', '是否参加志愿服务组织（加分项）', '0', '10103010801', '是', '3', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030108', '是否参加志愿服务组织（加分项）', '0', '10103010802', '否', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030109', '义务献血（加分项）（金奖/银奖/铜奖/有记录）', '0', '10103010901', '金奖', '12', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030109', '义务献血（加分项）（金奖/银奖/铜奖/有记录）', '0', '10103010902', '银奖', '8', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030109', '义务献血（加分项）（金奖/银奖/铜奖/有记录）', '0', '10103010903', '铜奖', '6', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030109', '义务献血（加分项）（金奖/银奖/铜奖/有记录）', '0', '10103010904', '有记录', '2', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030109', '义务献血（加分项）（金奖/银奖/铜奖/有记录）', '0', '10103010905', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030110', '捐献骨髓（有/无）（加分项）', '0', '10103011001', '有', '15', '1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030110', '捐献骨髓（有/无）（加分项）', '0', '10103011002', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030111', '*助人为乐次数（加分项）', '0', '10103011101', '无', '0', '0', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010301', '社会公德情况', '101030111', '*助人为乐次数（加分项）', '0', '10103011102', '1', '12', '1', '1');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030201', '*孝老爱亲（是/否）', '9', '10103020101', '是', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030201', '*孝老爱亲（是/否）', '9', '10103020102', '否', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030202', '*家庭暴力（无/轻微/致伤/情节严重）', '9', '10103020201', '无', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030202', '*家庭暴力（无/轻微/致伤/情节严重）', '9', '10103020202', '轻微', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030202', '*家庭暴力（无/轻微/致伤/情节严重）', '9', '10103020203', '致伤', '18', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030202', '*家庭暴力（无/轻微/致伤/情节严重）', '9', '10103020204', '情节严重', '45', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030203', '*教养子女（是/否）', '9', '10103020301', '是', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030203', '*教养子女（是/否）', '9', '10103020302', '否', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030204', '*夫妻和睦（是/否）', '9', '10103020401', '是', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030204', '*夫妻和睦（是/否）', '9', '10103020402', '否', '9', '-1', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030205', '*婚丧文明（是/否）', '9', '10103020501', '是', '0', '0', '0');
INSERT INTO `person_credit_score_rule` VALUES ('101', '公职人员', '10103', '社会生活信用信息', '1010302', '家庭美德情况', '101030205', '*婚丧文明（是/否）', '9', '10103020502', '否', '9', '-1', '0');
